直到世界尽头
stay hungry, stay foolish

1. coding价值观
  加班加点, 保质保量.
  作为新手, 保证质量才能有更高的追求, 才能走得更远.
  保证质量虽然开始速度慢但不会一直慢, 随着积累速度会越来越快, 质量也会越来越高.
  不保证质量而去求速度, 一段时间后由于没有积累速度不会提升甚至降低, 而质量一定越来越差用户越来越不满意.
  保证质量是一个充满挑战迫使自己进步的过程, 这个过程带来无穷的激情, 因为是在完成一件又一件有趣有意义的事情.
  没有质量就没有好的结果.

2. 作一个有情怀的工程师
  永远像新手那样保持对未知世界的好奇心和探索心.
  无尽烦难誓愿解, 无涯技术誓愿学, 无量源码誓愿读.

3. 在低谷时改变, 在沉默中爆发
  坚忍, 勤奋.
  坚韧忍耐, 勤劳奋进.
  谷歌本会卖给雅虎最后却赢了雅虎, 苹果曾濒于破产却再创奇迹.
  没有任何具体事物可以从不变化, 成功和失败不过是白天黑夜的交替,
  不变的是外物的不断变化和不断挑战的心.

4. 数据结构和算法组成基本模块，众多基本模块组成功能模块，各层功能模块组成程序。

5. 看优秀的源码不要只停留在功能实现逻辑上，要深入研究其技术原理和技术选择。

6. 冯偌伊曼结构中操作码和数据放在一起存储，即认为操作码(程序代码)也是一种数据；
  哈弗结构中操作码和数据分开存储。